In [63]:
import pandas as pd
col1=["이름", "국어", "영어"]
df1 = pd.DataFrame([['송중기', 77, 80], ['김나현', 92, 72], ['권보아', 62, 88], 
                    ['박효신', 91, 95]], columns=col1)
df2 = df1.copy()
df3 = df1.copy()
df4 = df1.copy()
df5 = df1.copy()

df1

    이름  국어  영어
0  송중기  77  80
1  김나현  92  72
2  권보아  62  88
3  박효신  91  95

In [64]:
df1.loc[df1["국어"] > 90, :]

    이름  국어  영어
1  김나현  92  72
3  박효신  91  95

In [65]:
df1.loc[df1["국어"] > 90, "국어"]

1    92
3    91
Name: 국어, dtype: int64

In [66]:
df1.loc[df1["국어"] > 90, "국어"] = "A"
df1

    이름  국어  영어
0  송중기  77  80
1  김나현   A  72
2  권보아  62  88
3  박효신   A  95

In [67]:
df2

    이름  국어  영어
0  송중기  77  80
1  김나현  92  72
2  권보아  62  88
3  박효신  91  95

In [68]:
df2["국어"] > 90

0    False
1     True
2    False
3     True
Name: 국어, dtype: bool

In [69]:
df2["국어"].mask(df2["국어"] > 90, "A")

0    77
1     A
2    62
3     A
Name: 국어, dtype: object

In [70]:
df2["국어"] = df2["국어"].mask(df2["국어"] > 90, "A")
df2

    이름  국어  영어
0  송중기  77  80
1  김나현   A  72
2  권보아  62  88
3  박효신   A  95

In [71]:
df3

    이름  국어  영어
0  송중기  77  80
1  김나현  92  72
2  권보아  62  88
3  박효신  91  95

In [72]:
df3["국어"].mask(df3["영어"] > 80, "면제")

0    77
1    92
2    면제
3    면제
Name: 국어, dtype: object

In [73]:
df3["국어최종"] = df3["국어"].mask(df3["영어"] > 80, "면제")
df3

    이름  국어  영어 국어최종
0  송중기  77  80   77
1  김나현  92  72   92
2  권보아  62  88   면제
3  박효신  91  95   면제

In [74]:
df4

    이름  국어  영어
0  송중기  77  80
1  김나현  92  72
2  권보아  62  88
3  박효신  91  95

In [75]:
cond1 = df4["국어"] > 90
cond2 = df4["영어"] > 90

df4["국어"] = df4["국어"].mask(cond1 & cond2, "우수")
df4

    이름  국어  영어
0  송중기  77  80
1  김나현  92  72
2  권보아  62  88
3  박효신  우수  95

In [76]:
df5

    이름  국어  영어
0  송중기  77  80
1  김나현  92  72
2  권보아  62  88
3  박효신  91  95

In [78]:
cond1 = df5["국어"] > 90

df5["국어점수"] = df5["국어"].mask(cond1, "A").mask(~cond1, "B")
df5

    이름  국어  영어 국어점수
0  송중기  77  80    B
1  김나현  92  72    A
2  권보아  62  88    B
3  박효신  91  95    A